import datetime
import time



#将时间对象转换成字符串


a = datetime.datetime.now().strftime("%Y-%m-%d %H:%M")
print a
 
print "################################################################"
 
##时间大小比较

t1 = time.strptime('2011-01-20 14:05',"%Y-%m-%d %H:%M")
t2 = time.strptime('2011-01-20 16:05',"%Y-%m-%d %H:%M")

if t1 > t2:
    print t1
if t1 < t2:
    print t2
    
print "################################################################"
    
#时间差值计算,计算8小时前的时间

a = datetime.datetime.now().strftime("%Y-%m-%d %H:%M")
print a

a = (datetime.datetime.now() - datetime.timedelta(hours=8)).strftime("%Y-%m-%d %H:%M")
print a

 
print "################################################################"
 
#将字符串转换成时间对象

endtime=datetime.datetime.strptime('20100701',"%Y%m%d")

type(endtime)
print endtime

 
print "################################################################"
 
#将从 1970-01-01 00:00:00 UTC 到现在的秒数，格式化输出   
 
a = 1302153828
print time.strftime("%Y-%m-%d %H:%M:%S",time.localtime(a))
 



print "################################################################"


#######################################################################


#######################################################################


#######################################################################


#######################################################################

