#coding=utf-8
#import threading
#import time
#import re
#import urllib

"""

童鞋们好，我们的进阶课终于要讲完了。这里，留给大家一道进阶篇的结束题。要求如下：


【准备步骤】
1.申请一个微博的开发者账号，http://open.weibo.com/apps
2.为新申请的开发者账号，添加几个测试账号
3.找到新浪的python sdk 



【需求】

1.已知一个网站 http://c/，网站名为 “鞋推网”
2.网站使用微博的账号密码登陆。
3.登陆成功后，显示京东网 搜索 鞋子 的第一页结果列表。（如果能分页肯定更好了，但不强求）

3.1 结果列表中需包含图片，名字。
3.2 图片需存储在本地。


4.点击列表中的任意一个图片后，立即分享到新浪微博。（使用哪个账号登陆，就使用那个账号发一个微博）微博内容如下

“我在鞋推网为我推荐了一双鞋子[鞋子的名字]，哈哈。http://c/”
此信息后附一张鞋图片


【完成】
给大家10天的时间。之后我们开始讲解这道结业题。


这道题综合了我们以前所有的知识。

"""

def (${2:}):
    ${0}